axf33480/ESP32CommandStation/src/ConfigurationManager.cpp
  if (factory_reset_config)
  {
    LOG(INFO, "[Config] Generating default configuration...");
    // TODO: break this up so it starts with an empty config and makes calls to
    // various "getDefaultConfigXXX" for each section.
    commandStationConfig = {};
    persist_config = seedDefaultConfigSections();
    // force factory reset of LCC data
    lcc_factory_reset = true;
  }

  // if we need to persist the updated config do so now.
  if (persist_config)
  {
    LOG(INFO, "[Config] Persisting configuration settings");
    store(ESP32_CS_CONFIG_JSON, commandStationConfig.dump());
  }
  LOG(VERBOSE, "[Config] %s", commandStationConfig.dump().c_str());

  // If we are not currently forcing a factory reset, verify if the LCC config
  // file is the correct size. If it is not the expected size force a factory
  // reset.
  if (!lcc_factory_reset &&
      stat(LCC_NODE_CONFIG_FILE, &statbuf) >= 0 &&
      statbuf.st_size != openlcb::CONFIG_FILE_SIZE)
  {
    LOG(WARNING
      , "[LCC] Corrupt configuration file detected, %s is too small: %lu "
        "bytes, expected: %zu bytes"
      , LCC_NODE_CONFIG_FILE, statbuf.st_size, openlcb::CONFIG_FILE_SIZE);
    lcc_factory_reset = true;
  }

  // If we need an LCC factory reset trigger is now.
  if (lcc_factory_reset)
  {
    configStore->factory_reset_lcc(false);
  }
}

ConfigurationManager::~ConfigurationManager()
{
  extern std::unique_ptr<OpenMRN> openmrn;

  // Shutdown the auto-sync handler if it is running before unmounting the FS.
  if (configAutoSync_.get())
  {
    LOG(INFO, "[Config] Disabling automatic fsync(%d) calls...", configFd_);
    SyncNotifiable n;
    configAutoSync_->shutdown(&n);
    n.wait_for_notification();
    configAutoSync_.reset(nullptr);
  }

  // shutdown the executor so that no more tasks will run
  openmrn->stack()->executor()->shutdown();

  // close the config file if it is open
  if (configFd_ >= 0)
  {
    ::close(configFd_);
  }

  // Unmount the SPIFFS partition
  if (esp_spiffs_mounted(NULL))
  {
    LOG(INFO, "[Config] Unmounting SPIFFS...");
    ESP_ERROR_CHECK(esp_vfs_spiffs_unregister(NULL));
  }

  // Unmount the SD card if it was mounted
  if (sdcard)
  {
    LOG(INFO, "[Config] Unmounting SD...");
    esp_vfs_fat_sdmmc_unmount();
  }
}

void ConfigurationManager::clear()
{
  LOG(INFO, "[Config] Clearing persistent config...");
  string configRoot = ESP32CS_CONFIG_DIR;
  recursiveWalkTree(configRoot, true);
  mkdir(configRoot.c_str(), ACCESSPERMS);
}

bool ConfigurationManager::exists(const string &name)
{
  string oldConfigFilePath = getFilePath(name, true);
  string configFilePath = getFilePath(name);
  if (!access(oldConfigFilePath.c_str(), F_OK) &&
      access(configFilePath.c_str(), F_OK))
  {
    LOG(INFO, "[Config] Migrating configuration file %s to %s."
      , oldConfigFilePath.c_str()
      , configFilePath.c_str());
    rename(oldConfigFilePath.c_str(), configFilePath.c_str());
  }
  LOG(VERBOSE, "[Config] Checking for %s", configFilePath.c_str());
  return access(configFilePath.c_str(), F_OK) == 0;
}

void ConfigurationManager::remove(const string &name)
{
  string configFilePath = getFilePath(name);
  LOG(VERBOSE, "[Config] Removing %s", configFilePath.c_str());
  unlink(configFilePath.c_str());
}

string ConfigurationManager::load(const string &name)
{
  string configFilePath = getFilePath(name);
  if (!exists(name))
  {
    LOG(VERBOSE, "[Config] Failed to load: %s", configFilePath.c_str());
    return "{}";
  }
  LOG(VERBOSE, "[Config] Loading %s", configFilePath.c_str());
  return read_file_to_string(configFilePath);
}

void ConfigurationManager::store(const char *name, const string &content)
{
  string configFilePath = getFilePath(name);
  LOG(VERBOSE, "[Config] Storing %s, %d bytes", configFilePath.c_str()
    , content.length());
  write_string_to_file(configFilePath, content);
}

void ConfigurationManager::factory_reset_lcc(bool warn)
{
  if (!access(LCC_NODE_CONFIG_FILE, F_OK) ||
      !access(LCC_NODE_CDI_FILE, F_OK))
  {
    if (warn)
    {
      LOG(WARNING, "[Config] LCC factory reset underway...");
    }

    if (!access(LCC_NODE_CONFIG_FILE, F_OK))
    {
      LOG(WARNING, "[Config] Removing %s", LCC_NODE_CONFIG_FILE);
      ERRNOCHECK(LCC_NODE_CONFIG_FILE, unlink(LCC_NODE_CONFIG_FILE));
    }
    if (!access(LCC_NODE_CDI_FILE, F_OK))
    {
      LOG(WARNING, "[Config] Removing %s", LCC_NODE_CDI_FILE);
      ERRNOCHECK(LCC_NODE_CDI_FILE, unlink(LCC_NODE_CDI_FILE));
    }
    if (warn)
    {
      LOG(WARNING
        , "[Config] The ESP32 CommandStation needs to be restarted in order "
          "to complete the factory reset.");
    }
  }
}

NodeID ConfigurationManager::getNodeId()
{
  auto lccConfig = commandStationConfig[JSON_LCC_NODE];
  return (NodeID)lccConfig[JSON_LCC_NODE_ID_NODE].get<uint64_t>();
}

bool ConfigurationManager::setNodeID(string value)
{
  LOG(INFO, "[Config] Current NodeID: %s, updated NodeID: %s"
    , uint64_to_string_hex(getNodeId()).c_str(), value.c_str());
  // remove period characters if present
  value.erase(std::remove(value.begin(), value.end(), '.'), value.end());
  // convert the string to a uint64_t value
  uint64_t new_node_id{0};
  std::stringstream stream;
  stream << std::hex << value;
  stream >> new_node_id;
  if (new_node_id != getNodeId())
  {
    LOG(INFO
      , "[Config] Persisting NodeID: %s and enabling forced factory_reset."
      , uint64_to_string_hex(new_node_id).c_str());
    commandStationConfig[JSON_LCC_NODE][JSON_LCC_NODE_ID_NODE] = new_node_id;
    commandStationConfig[JSON_LCC_NODE][JSON_LCC_FORCE_RESET_NODE] = true;
    store(ESP32_CS_CONFIG_JSON, commandStationConfig.dump());
    return true;
  }
  return false;
}

void ConfigurationManager::configureLCC(OpenMRN *openmrn)
{
  auto lccConfig = commandStationConfig[JSON_LCC_NODE];
  if (lccConfig.contains(JSON_LCC_CAN_NODE))
  {
    auto canConfig = lccConfig[JSON_LCC_CAN_NODE];
    gpio_num_t canRXPin =
      (gpio_num_t)canConfig[JSON_LCC_CAN_RX_NODE].get<uint8_t>();
    gpio_num_t canTXPin =
      (gpio_num_t)canConfig[JSON_LCC_CAN_TX_NODE].get<uint8_t>();
    if (canRXPin < GPIO_NUM_MAX && canTXPin < GPIO_NUM_MAX)
    {
      LOG(INFO, "[Config] Enabling LCC CAN interface (rx: %d, tx: %d)"
        , canRXPin, canTXPin);
      openmrn->add_can_port(
        new Esp32HardwareCan("esp32can", canRXPin, canTXPin, false));
    }
  }

