axf33480/ESP32CommandStation/src/ConfigurationManager.cpp
  // Create the CDI.xml dynamically if it doesn't already exist.
  openmrn->create_config_descriptor_xml(cfg_, LCC_NODE_CDI_FILE);

  // Create the default internal configuration file if it doesn't already exist.
  configFd_ =
    openmrn->stack()->create_config_file_if_needed(cfg_.seg().internal_config()
                                                 , ESP32CS_CDI_VERSION
                                                 , openlcb::CONFIG_FILE_SIZE);

#if CONFIG_USE_SD
  // ESP32 FFat library uses a 512b cache in memory by default for the SD VFS
  // adding a periodic fsync call for the LCC configuration file ensures that
  // config changes are saved since the LCC config file is less than 512b.
  LOG(INFO, "[Config] Creating automatic fsync(%d) calls every %dsec."
    , configFd_, config_lcc_sd_sync_interval_sec());
  configAutoSync_.reset(new AutoSyncFileFlow(openmrn->stack()->service()
                      , configFd_
                      , SEC_TO_USEC(config_lcc_sd_sync_interval_sec())));
#endif // CONFIG_USE_SD
}

void ConfigurationManager::setWiFiStationParams(string ssid, string password
                                              , string ip, string gateway
                                              , string subnet)
{
  string wifimode = commandStationConfig[JSON_WIFI_NODE][JSON_WIFI_MODE_NODE];
  if (wifimode.compare(JSON_VALUE_WIFI_MODE_SOFTAP_ONLY))
  {
    LOG(INFO, "[Config] Current config is SoftAP only, enabling Station mode");
    commandStationConfig[JSON_WIFI_NODE][JSON_WIFI_MODE_NODE] = JSON_VALUE_WIFI_MODE_SOFTAP_STATION;
  }
  LOG(INFO, "[Config] Reconfiguring Station SSID to '%s'", ssid.c_str());
  if (!ssid.empty())
  {
    commandStationConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_SSID_NODE] = ssid;
    commandStationConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_PASSWORD_NODE] = password;
  }
  if (ip.empty())
  {
    string ipmode = commandStationConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_MODE_NODE];
    if (ipmode.compare(JSON_VALUE_STATION_IP_MODE_DHCP))
    {
      LOG(INFO, "[Config] Reconfiguring Station IP mode to DHCP");
      commandStationConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_MODE_NODE] = JSON_VALUE_STATION_IP_MODE_DHCP;
      commandStationConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_STATION_IP_NODE] = "";
      commandStationConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_STATION_GATEWAY_NODE] = "";
      commandStationConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_STATION_NETMASK_NODE] = "";
    }
  }
  else
  {
    LOG(INFO
      , "[Config] Reconfiguring Station IP mode to STATIC using:\n"
        "ip: %s\n gateway: %s\nsubnet: %s"
      , ip.c_str(), gateway.c_str(), subnet.c_str());
    commandStationConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_MODE_NODE] = JSON_VALUE_STATION_IP_MODE_STATIC;
    commandStationConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_STATION_IP_NODE] = ip;
    commandStationConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_STATION_GATEWAY_NODE] = gateway;
    commandStationConfig[JSON_WIFI_NODE][JSON_WIFI_STATION_NODE][JSON_WIFI_STATION_NETMASK_NODE] = subnet;
  }
  // persist the new config
  store(ESP32_CS_CONFIG_JSON, commandStationConfig.dump());
}

string ConfigurationManager::getFilePath(const string &name, bool oldPath)
{
  if (oldPath)
  {
    return StringPrintf("%s/%s", OLD_CONFIG_DIR, name.c_str());
  }
  return StringPrintf("%s/%s", ESP32CS_CONFIG_DIR, name.c_str());
}

bool ConfigurationManager::validateConfiguration()
{
  if (!commandStationConfig.contains(JSON_WIFI_NODE))
  {
    LOG_ERROR("[Config] WiFi configuration not found.");
    return false;
  }
  else if (!commandStationConfig.contains(JSON_LCC_NODE))
  {
    LOG_ERROR("[Config] LCC configuration not found.");
    return false;
  }

  auto wifiNode = commandStationConfig[JSON_WIFI_NODE];
  LOG(VERBOSE, "[Config] WiFi config: %s", wifiNode.dump().c_str());

  // Verify that the wifi operating mode is one of the three supported
  // modes.
  string wifiMode = wifiNode[JSON_WIFI_MODE_NODE];
  if (wifiMode.compare(JSON_VALUE_WIFI_MODE_SOFTAP_ONLY) &&
      wifiMode.compare(JSON_VALUE_WIFI_MODE_SOFTAP_STATION) &&
      wifiMode.compare(JSON_VALUE_WIFI_MODE_STATION_ONLY))
  {
    LOG_ERROR("[Config] Unknown WiFi operating mode: %s!", wifiMode.c_str());
    return false;
  }

  // If we are not operating in AP only mode we should verify we have
  // an SSID.
  if (wifiMode.compare(JSON_VALUE_WIFI_MODE_SOFTAP_ONLY) &&
    (!wifiNode[JSON_WIFI_STATION_NODE].contains(JSON_WIFI_SSID_NODE) ||
     !wifiNode[JSON_WIFI_STATION_NODE].contains(JSON_WIFI_PASSWORD_NODE)))
  {
    LOG_ERROR("[Config] SSID/Password was not specified for Station mode!");
    return false;
  }

  // If we are operating in SoftAP only we require a default SSID name
  if (!wifiMode.compare(JSON_VALUE_WIFI_MODE_SOFTAP_ONLY) &&
      !wifiNode[JSON_WIFI_SOFTAP_NODE].contains(JSON_WIFI_SSID_NODE))
  {
    LOG_ERROR("[Config] SSID was not specified for SoftAP mode!");
    return false;
  }

  // verify LCC configuration
  auto lccNode = commandStationConfig[JSON_LCC_NODE];
  LOG(VERBOSE, "[Config] LCC config: %s", lccNode.dump().c_str());

  if (!lccNode.contains(JSON_LCC_NODE_ID_NODE) ||
      lccNode[JSON_LCC_NODE_ID_NODE].get<uint64_t>() == 0)
  {
    LOG_ERROR("[Config] Missing LCC node ID!");
    return false;
  }

  if (!lccNode.contains(JSON_LCC_CAN_NODE) ||
      !lccNode[JSON_LCC_CAN_NODE].contains(JSON_LCC_CAN_RX_NODE) ||
      !lccNode[JSON_LCC_CAN_NODE].contains(JSON_LCC_CAN_TX_NODE))
  {
    LOG_ERROR("[Config] LCC CAN configuration invalid.");
    return false;
  }

  return true;
}

bool ConfigurationManager::seedDefaultConfigSections()
{
  bool config_updated{false};

  // If LCC config is missing default it.
  if (!commandStationConfig.contains(JSON_LCC_NODE))
  {
    commandStationConfig[JSON_LCC_NODE] =
    {
      { JSON_LCC_NODE_ID_NODE, UINT64_C(LCC_NODE_ID) },
      { JSON_LCC_CAN_NODE,
        {
          { JSON_LCC_CAN_RX_NODE, LCC_CAN_RX_PIN },
          { JSON_LCC_CAN_TX_NODE, LCC_CAN_TX_PIN },
        }
      },
      { JSON_LCC_FORCE_RESET_NODE, false },
    };
    config_updated = true;
  }
  // If LCC config is missing default it.
  if (!commandStationConfig.contains(JSON_WIFI_NODE))
  {
    commandStationConfig[JSON_WIFI_NODE] =
    {
#if WIFI_ENABLE_SOFT_AP_ONLY
      { JSON_WIFI_MODE_NODE, JSON_VALUE_WIFI_MODE_SOFTAP_ONLY },
      { JSON_WIFI_SOFTAP_NODE,
        {
          { JSON_WIFI_SSID_NODE, wifiSSID_ },
/*
          { JSON_WIFI_PASSWORD_NODE, wifiPassword_ },
*/
        },
      },
#elif WIFI_ENABLE_SOFT_AP
      { JSON_WIFI_MODE_NODE, JSON_VALUE_WIFI_MODE_SOFTAP_STATION },
      { JSON_WIFI_SOFTAP_NODE,
        {
          { JSON_WIFI_SSID_NODE, wifiSSID_ },
        },
      },
#else
      { JSON_WIFI_MODE_NODE, JSON_VALUE_WIFI_MODE_STATION_ONLY },
#endif
#ifdef WIFI_STATIC_IP_DNS
      { JSON_WIFI_DNS_NODE, WIFI_STATIC_IP_DNS },
#endif
#if !WIFI_ENABLE_SOFT_AP_ONLY
      { JSON_WIFI_STATION_NODE, 
        {
#if defined(WIFI_STATIC_IP_ADDRESS) && defined(WIFI_STATIC_IP_GATEWAY) && defined(WIFI_STATIC_IP_SUBNET)
          { JSON_WIFI_MODE_NODE, JSON_VALUE_STATION_IP_MODE_STATIC },
          { JSON_WIFI_STATION_IP_NODE, WIFI_STATIC_IP_ADDRESS },
          { JSON_WIFI_STATION_GATEWAY_NODE, WIFI_STATIC_IP_GATEWAY },
          { JSON_WIFI_STATION_NETMASK_NODE, WIFI_STATIC_IP_SUBNET },
#else
          { JSON_WIFI_MODE_NODE, JSON_VALUE_STATION_IP_MODE_DHCP },
#endif
          { JSON_WIFI_SSID_NODE, wifiSSID_ },
          { JSON_WIFI_PASSWORD_NODE, wifiPassword_ },
        }
      },
#endif
    };
    config_updated = true;
  }
  // If HC12 config is missing default it.
  if (!commandStationConfig.contains(JSON_HC12_NODE))
  {
    commandStationConfig[JSON_HC12_NODE] =
    {
      { JSON_HC12_ENABLED_NODE, HC12_RADIO_ENABLED },
      { JSON_HC12_UART_NODE, HC12_UART_NUM },
      { JSON_HC12_RX_NODE, HC12_RX_PIN },
      { JSON_HC12_TX_NODE, HC12_TX_PIN },
    };
    // flag to indicate we need to persist the configuration update
    config_updated = true;
  }
  // If HBridge config is missing default it.
  if (!commandStationConfig.contains(JSON_HBRIDGES_NODE))
  {
    commandStationConfig[JSON_HBRIDGES_NODE] =
    {
      { "OPS",
        {
          { JSON_HBRIDGE_PREAMBLE_BITS_NODE, OPS_PREAMBLE_BITS },
          { JSON_HBRIDGE_RMT_CHANNEL_NODE, RMT_CHANNEL_0 },
          { JSON_HBRIDGE_ENABLE_PIN_NODE, OPS_ENABLE_PIN },
          { JSON_HBRIDGE_SIGNAL_PIN_NODE, OPS_SIGNAL_PIN },
          { JSON_HBRIDGE_THERMAL_PIN_NODE, OPS_THERMAL_PIN },
          { JSON_HBRIDGE_SENSE_PIN_NODE, OPS_CURRENT_SENSE_ADC },
          { JSON_RAILCOM_NODE, RAILCOM_ENABLE_PIN != NOT_A_PIN }
        },
      },
      { "PROG",
        {
          { JSON_HBRIDGE_PREAMBLE_BITS_NODE, PROG_PREAMBLE_BITS },
          { JSON_HBRIDGE_RMT_CHANNEL_NODE, RMT_CHANNEL_1 },
          { JSON_HBRIDGE_ENABLE_PIN_NODE, PROG_ENABLE_PIN },
          { JSON_HBRIDGE_SIGNAL_PIN_NODE, PROG_SIGNAL_PIN },
          { JSON_HBRIDGE_SENSE_PIN_NODE, PROG_CURRENT_SENSE_ADC },
        },
      }
    };
    // flag to indicate we need to persist the configuration update
    config_updated = true;
  }
  // If RailCom config is missing default it.
  if (!commandStationConfig.contains(JSON_RAILCOM_NODE))
  {
    commandStationConfig[JSON_RAILCOM_NODE] =
    {
      { JSON_RAILCOM_ENABLE_PIN_NODE, RAILCOM_ENABLE_PIN },
      { JSON_RAILCOM_BRAKE_PIN_NODE, RAILCOM_BRAKE_ENABLE_PIN },
      { JSON_RAILCOM_SHORT_PIN_NODE, RAILCOM_SHORT_PIN },
      { JSON_RAILCOM_UART_NODE, RAILCOM_UART },
      { JSON_RAILCOM_RX_NODE, RAILCOM_UART_RX_PIN },
    };
    // flag to indicate we need to persist the configuration update
    config_updated = true;
  }
  return config_updated;
}

